# Задача №5: Реализовать алгоритм перемешивания списка.

import random
list = [45,34,5,23,45,67,8]
random.shuffle(list)
print(list)